<?php

return [

    'login' => 'تسجيل الدخول',
    'login_button' => 'دخول',
    'logout' => 'تسجيل الخروج',

    'register' => 'إنشاء حساب',
    'register_button' => 'تسجيل',
    "not_have_an_account" => "ليس لديك حساب",
    'name' => 'الاسم',
    'email' => 'البريد الإلكتروني',
    'password' => 'كلمة المرور',
    'confirm_password' => 'تأكيد كلمة المرور',

    'remember_me' => 'تذكرني',

    'forgot_password' => 'هل نسيت كلمة المرور؟',

    'forgot_password_message' =>
        'هل نسيت كلمة المرور؟ لا مشكلة. أدخل عنوان بريدك الإلكتروني وسنرسل لك رابطًا لإعادة تعيين كلمة المرور، يمكنك من خلاله اختيار كلمة مرور جديدة.',

    'email_password_reset_link' =>
        'إرسال رابط إعادة تعيين كلمة المرور',

    'reset_password' =>
        'إعادة تعيين كلمة المرور',

    'reset_password_button' =>
        'إعادة تعيين كلمة المرور',

    'confirm' => 'تأكيد',

    'confirm_password_message' =>
        'هذه منطقة آمنة من التطبيق. يرجى تأكيد كلمة المرور قبل المتابعة.',

    'already_registered' =>
        'مسجل بالفعل؟',

    'verify_email' =>
        'تأكيد البريد الإلكتروني',

    'verify_email_message' =>
        'شكرًا لتسجيلك! قبل البدء، يرجى تأكيد عنوان بريدك الإلكتروني من خلال الضغط على الرابط الذي أرسلناه إليك عبر البريد الإلكتروني. إذا لم تستلم البريد الإلكتروني، يمكننا إرسال رابط آخر إليك.',

    'verification_link_sent' =>
        'تم إرسال رابط تأكيد جديد إلى عنوان البريد الإلكتروني الذي استخدمته أثناء التسجيل.',

    'resend_verification_email' =>
        'إعادة إرسال رسالة تأكيد البريد الإلكتروني',

    /*
    |--------------------------------------------------------------------------
    | Authentication Errors
    |--------------------------------------------------------------------------
    */

    'failed' =>
        'بيانات تسجيل الدخول غير صحيحة.',

    'password_incorrect' =>
        'كلمة المرور غير صحيحة.',

    'throttle' =>
        'عدد محاولات تسجيل الدخول كبير جدًا. يرجى المحاولة مرة أخرى بعد :seconds ثانية.',


    /*
    |--------------------------------------------------------------------------
    | Password Reset Messages
    |--------------------------------------------------------------------------
    */

    'passwords' => [

        'reset' =>
            'تمت إعادة تعيين كلمة المرور بنجاح.',

        'sent' =>
            'تم إرسال رابط إعادة تعيين كلمة المرور إلى بريدك الإلكتروني.',

        'throttled' =>
            'يرجى الانتظار قبل إعادة المحاولة.',

        'token' =>
            'رمز إعادة تعيين كلمة المرور غير صالح.',

        'user' =>
            'لا يمكن العثور على مستخدم بهذا البريد الإلكتروني.',

    ],

];
